In [92]:
import numpy as np
import pandas as pd
import json
import ast
import sqlite3 as sq3

In [93]:
df = pd.read_json("In-Class.json", orient='split')

In [94]:
title = df[['id','title']]

In [95]:
title.head(2)

       id              title
0  299534  Avengers: Endgame
1   19995             Avatar

In [96]:
Revenue = df[['id','revenue']]

In [97]:
Revenue.head(2)

       id     revenue
0  299534  2797800564
1   19995  2787965087

In [98]:
Genre = df[['id','genres']]

In [99]:
Genre.head()

       id                                             genres
0  299534  [{'id': 12, 'name': 'Adventure'}, {'id': 878, ...
1   19995  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...
2  140607  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...
3  299536  [{'id': 12, 'name': 'Adventure'}, {'id': 28, '...
4     597  [{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...

In [100]:
Genre.genres[0]

[{'id': 12, 'name': 'Adventure'},
 {'id': 878, 'name': 'Science Fiction'},
 {'id': 28, 'name': 'Action'}]

In [101]:
df.head()

,title,id,revenue,genres,belongs_to_collection,runtime
0,Avengers: Endgame,299534,2797800564,"[{'id': 12, 'name': 'Adventure'}, {'id': 878, ...","{'id': 86311, 'name': 'The Avengers Collection...",181
1,Avatar,19995,2787965087,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 87096, 'name': 'Avatar Collection', 'po...",162
2,Star Wars: The Force Awakens,140607,2068223624,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 10, 'name': 'Star Wars Collection', 'po...",136
3,Avengers: Infinity War,299536,2046239637,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...","{'id': 86311, 'name': 'The Avengers Collection...",149
4,Titanic,597,1845034188,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",None,194

In [102]:
df.genres = df.genres.apply(lambda x: '&'.join(i['name'] for i in x) if isinstance(x,list)  else np.nan)

In [103]:
df.head()

,title,id,revenue,genres,belongs_to_collection,runtime
0,Avengers: Endgame,299534,2797800564,Adventure&Science Fiction&Action,"{'id': 86311, 'name': 'The Avengers Collection...",181
1,Avatar,19995,2787965087,Action&Adventure&Fantasy&Science Fiction,"{'id': 87096, 'name': 'Avatar Collection', 'po...",162
2,Star Wars: The Force Awakens,140607,2068223624,Action&Adventure&Science Fiction&Fantasy,"{'id': 10, 'name': 'Star Wars Collection', 'po...",136
3,Avengers: Infinity War,299536,2046239637,Adventure&Action&Science Fiction,"{'id': 86311, 'name': 'The Avengers Collection...",149
4,Titanic,597,1845034188,Drama&Romance&Thriller,None,194

In [104]:
type(df.belongs_to_collection)

pandas.core.series.Series

In [105]:
df.belongs_to_collection[0]

{'id': 86311,
 'name': 'The Avengers Collection',
 'poster_path': '/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg',
 'backdrop_path': '/zuW6fOiusv4X9nnW3paHGfXcSll.jpg'}

In [106]:
data = df.belongs_to_collection

### Converts to dictionary

In [107]:
data = data.to_dict()

In [108]:
type(data)

dict

### Converts from dictionary to a DataFrame

In [109]:
data = pd.DataFrame.from_dict(data).T
data

,backdrop_path,id,name,poster_path
0,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg
1,/8nCr9W7sKus2q9PLbYsnT7iCkuT.jpg,87096,Avatar Collection,/nslJVsO58Etqkk17oXMuVK4gNOF.jpg
2,/d8duYyyC9J5T825Hg7grmaabfxQ.jpg,10,Star Wars Collection,/iTQHKziZy9pAAY4hHEDCGPaOvFC.jpg
3,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg
4,None,None,None,None
5,/pJjIH9QN0OkHFV9eue6XfRVnPkr.jpg,328,Jurassic Park Collection,/qIm2nHXLpBBdMxi8dvfrnDkBUDh.jpg
6,None,None,None,None
7,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg
8,/z5A5W3WYJc3UVEWljSGwdjDgQ0j.jpg,9485,The Fast and the Furious Collection,/uv63yAGg1zETAs1XQsOQpava87l.jpg
9,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg
10,/1Jj7Frjjbewb6Q6dl6YXhL3kuvL.jpg,529892,Black Panther Collection,/9ZSPIsxI3TZDgfg0Jzk0RZl4INg.jpg
11,/wfnMt6LGqYHcNyOfsuusw5lX3bL.jpg,1241,Harry Potter Collection,/eVPs2Y0LyvTLZn6AP5Z6O2rtiGB.jpg
12,/d8duYyyC9J5T825Hg7grmaabfxQ.jpg,10,Star Wars Collection,/iTQHKziZy9pAAY4hHEDCGPaOvFC.jpg
13,/vZiqhw6oFoMlHSneIdVip9rRou2.jpg,386382,Frozen Collection,/rpoXnE9UzCbjmINhxIi8bZF557B.jpg
14,/pJjIH9QN0OkHFV9eue6XfRVnPkr.jpg,328,Jurassic Park Collection,/qIm2nHXLpBBdMxi8dvfrnDkBUDh.jpg
15,/vZiqhw6oFoMlHSneIdVip9rRou2.jpg,386382,Frozen Collection,/rpoXnE9UzCbjmINhxIi8bZF557B.jpg
16,None,None,None,None
17,/9eDW2dVhnzPS2HvaRdK2OlAGaLq.jpg,468222,The Incredibles Collection,/l7GqbzkJwowYRIXAtUz2iCPi64a.jpg

In [118]:
data['id'] = df.id

In [119]:
B_2_C= data

In [3]:
#B_2_C.code.value_counts(dropna=False) #not working

In [5]:
#B_2_C = B_2_C.code.apply(lambda x: pd.drop for i in x if i=='None')

In [ ]:
B_2_C

In [121]:
for value in B_2_C.index:
    if str(B_2_C.name)=='None':
        B_2_C.drop(value, axis=0, inplace=True)

In [122]:
B_2_C.dtypes

backdrop_path    object
id                int64
name             object
poster_path      object
dtype: object

In [ ]:
for value in B_2_C.index:
    if str(B_2_C.name[value]) == 'None':
        B_2_C.drop(value, inplace=True)

In [ ]:
B_2_C.name[1]

In [ ]:
B_2_C.dtypes

In [ ]:
B_2_C

In [123]:
data = data.rename(columns={'id':'code'})

In [124]:
con = sq3.connect('Try.db')

In [6]:
#title.to_sql('Title', con, index=False)

In [ ]:
con.execute('sel')

In [ ]:
Revenue.to_sql('Revenue', con, index=False)

In [ ]:
con.close()

# Merging data

In [ ]:
data1 = df.merge(data, how='left', left_on='id', right_on='code')

In [ ]:
data1

In [ ]:
df.belongs_to_collection[0]

In [ ]:
type(df.belongs_to_collection[0])

In [ ]:
pd.DataFrame.from_dict(df.belongs_to_collection, orient='index').T